IOsetting/py32f0-template/Libraries/CMSIS/Device/PY32F0xx/Include/py32f072x9.h
/******************  Bit definition for USART_BRR register  *******************/
#define USART_BRR_DIV_Fraction_Pos          (0U)
#define USART_BRR_DIV_Fraction_Msk          (0xFUL << USART_BRR_DIV_Fraction_Pos)   /*!< 0x0000000F */
#define USART_BRR_DIV_Fraction              USART_BRR_DIV_Fraction_Msk              /*!< Fraction of USARTDIV */
#define USART_BRR_DIV_Mantissa_Pos          (4U)
#define USART_BRR_DIV_Mantissa_Msk          (0xFFFUL << USART_BRR_DIV_Mantissa_Pos) /*!< 0x0000FFF0 */
#define USART_BRR_DIV_Mantissa              USART_BRR_DIV_Mantissa_Msk              /*!< Mantissa of USARTDIV */

/******************  Bit definition for USART_CR1 register  *******************/
#define USART_CR1_SBK_Pos                   (0U)
#define USART_CR1_SBK_Msk                   (0x1UL << USART_CR1_SBK_Pos)        /*!< 0x00000001 */
#define USART_CR1_SBK                       USART_CR1_SBK_Msk                   /*!< Send Break */
#define USART_CR1_RWU_Pos                   (1U)
#define USART_CR1_RWU_Msk                   (0x1UL << USART_CR1_RWU_Pos)        /*!< 0x00000002 */
#define USART_CR1_RWU                       USART_CR1_RWU_Msk                   /*!< Receiver wakeup */
#define USART_CR1_RE_Pos                    (2U)
#define USART_CR1_RE_Msk                    (0x1UL << USART_CR1_RE_Pos)         /*!< 0x00000004 */
#define USART_CR1_RE                        USART_CR1_RE_Msk                    /*!< Receiver Enable */
#define USART_CR1_TE_Pos                    (3U)
#define USART_CR1_TE_Msk                    (0x1UL << USART_CR1_TE_Pos)         /*!< 0x00000008 */
#define USART_CR1_TE                        USART_CR1_TE_Msk                    /*!< Transmitter Enable */
#define USART_CR1_IDLEIE_Pos                (4U)
#define USART_CR1_IDLEIE_Msk                (0x1UL << USART_CR1_IDLEIE_Pos)     /*!< 0x00000010 */
#define USART_CR1_IDLEIE                    USART_CR1_IDLEIE_Msk                /*!< IDLE Interrupt Enable */
#define USART_CR1_RXNEIE_Pos                (5U)
#define USART_CR1_RXNEIE_Msk                (0x1UL << USART_CR1_RXNEIE_Pos)     /*!< 0x00000020 */
#define USART_CR1_RXNEIE                    USART_CR1_RXNEIE_Msk                /*!< RXNE Interrupt Enable */
#define USART_CR1_TCIE_Pos                  (6U)
#define USART_CR1_TCIE_Msk                  (0x1UL << USART_CR1_TCIE_Pos)       /*!< 0x00000040 */
#define USART_CR1_TCIE                      USART_CR1_TCIE_Msk                  /*!< Transmission Complete Interrupt Enable */
#define USART_CR1_TXEIE_Pos                 (7U)
#define USART_CR1_TXEIE_Msk                 (0x1UL << USART_CR1_TXEIE_Pos)      /*!< 0x00000080 */
#define USART_CR1_TXEIE                     USART_CR1_TXEIE_Msk                 /*!< PE Interrupt Enable */
#define USART_CR1_PEIE_Pos                  (8U)
#define USART_CR1_PEIE_Msk                  (0x1UL << USART_CR1_PEIE_Pos)       /*!< 0x00000100 */
#define USART_CR1_PEIE                      USART_CR1_PEIE_Msk                  /*!< PE Interrupt Enable */
#define USART_CR1_PS_Pos                    (9U)
#define USART_CR1_PS_Msk                    (0x1UL << USART_CR1_PS_Pos)         /*!< 0x00000200 */
#define USART_CR1_PS                        USART_CR1_PS_Msk                    /*!< Parity Selection */
#define USART_CR1_PCE_Pos                   (10U)
#define USART_CR1_PCE_Msk                   (0x1UL << USART_CR1_PCE_Pos)        /*!< 0x00000400 */
#define USART_CR1_PCE                       USART_CR1_PCE_Msk                   /*!< Parity Control Enable */
#define USART_CR1_WAKE_Pos                  (11U)
#define USART_CR1_WAKE_Msk                  (0x1UL << USART_CR1_WAKE_Pos)       /*!< 0x00000800 */
#define USART_CR1_WAKE                      USART_CR1_WAKE_Msk                  /*!< Wakeup method */
#define USART_CR1_M_Pos                     (12U)
#define USART_CR1_M_Msk                     (0x1UL << USART_CR1_M_Pos)          /*!< 0x00001000 */
#define USART_CR1_M                         USART_CR1_M_Msk                     /*!< Word length */
#define USART_CR1_UE_Pos                    (13U)
#define USART_CR1_UE_Msk                    (0x1UL << USART_CR1_UE_Pos)         /*!< 0x00002000 */
#define USART_CR1_UE                        USART_CR1_UE_Msk                    /*!< USART Enable */

/******************  Bit definition for USART_CR2 register  *******************/
#define USART_CR2_ADD_Pos                   (0U)
#define USART_CR2_ADD_Msk                   (0xFUL << USART_CR2_ADD_Pos)       /*!< 0x0000000F */
#define USART_CR2_ADD                       USART_CR2_ADD_Msk                  /*!< Address of the USART node */
#define USART_CR2_ADD_0                     (0x1UL << USART_CR2_ADD_Pos)       /*!< 0x00000001 */
#define USART_CR2_ADD_1                     (0x2UL << USART_CR2_ADD_Pos)       /*!< 0x00000002 */
#define USART_CR2_ADD_2                     (0x4UL << USART_CR2_ADD_Pos)       /*!< 0x00000004 */
#define USART_CR2_ADD_3                     (0x8UL << USART_CR2_ADD_Pos)       /*!< 0x00000008 */
#define USART_CR2_LBDL_Pos                  (5U)
#define USART_CR2_LBDL_Msk                  (0x1UL << USART_CR2_LBDL_Pos)      /*!< 0x00000020 */
#define USART_CR2_LBDL                      USART_CR2_LBDL_Msk                 /*!< LIN break detect length */
#define USART_CR2_LBDIE_Pos                 (6U)
#define USART_CR2_LBDIE_Msk                 (0x1UL << USART_CR2_LBDIE_Pos)     /*!< 0x00000040 */
#define USART_CR2_LBDIE                     USART_CR2_LBDIE_Msk                /*!< LIN break interrupt enable */
#define USART_CR2_LBCL_Pos                  (8U)
#define USART_CR2_LBCL_Msk                  (0x1UL << USART_CR2_LBCL_Pos)      /*!< 0x00000100 */
#define USART_CR2_LBCL                      USART_CR2_LBCL_Msk                 /*!< Last Bit Clock pulse */
#define USART_CR2_CPHA_Pos                  (9U)
#define USART_CR2_CPHA_Msk                  (0x1UL << USART_CR2_CPHA_Pos)      /*!< 0x00000200 */
#define USART_CR2_CPHA                      USART_CR2_CPHA_Msk                 /*!< Clock Phase */
#define USART_CR2_CPOL_Pos                  (10U)
#define USART_CR2_CPOL_Msk                  (0x1UL << USART_CR2_CPOL_Pos)      /*!< 0x00000400 */
#define USART_CR2_CPOL                      USART_CR2_CPOL_Msk                 /*!< Clock Polarity */
#define USART_CR2_CLKEN_Pos                 (11U)
#define USART_CR2_CLKEN_Msk                 (0x1UL << USART_CR2_CLKEN_Pos)     /*!< 0x00000800 */
#define USART_CR2_CLKEN                     USART_CR2_CLKEN_Msk                /*!< Clock Enable */
#define USART_CR2_STOP_Pos                  (12U)
#define USART_CR2_STOP_Msk                  (0x3UL << USART_CR2_STOP_Pos)      /*!< 0x00003000 */
#define USART_CR2_STOP                      USART_CR2_STOP_Msk                 /*!< STOP bits*/
#define USART_CR2_STOP_0                    (0x1UL << USART_CR2_STOP_Pos)      /*!< 0x00001000 */
#define USART_CR2_STOP_1                    (0x2UL << USART_CR2_STOP_Pos)      /*!< 0x00002000 */
#define USART_CR2_LINEN_Pos                 (14U)
#define USART_CR2_LINEN_Msk                 (0x1UL << USART_CR2_LINEN_Pos)     /*!< 0x00004000 */
#define USART_CR2_LINEN                     USART_CR2_LINEN_Msk                /*!< LIN enable */

/******************  Bit definition for USART_CR3 register  *******************/
#define USART_CR3_EIE_Pos                   (0U)
#define USART_CR3_EIE_Msk                   (0x1UL << USART_CR3_EIE_Pos)       /*!< 0x00000001 */
#define USART_CR3_EIE                       USART_CR3_EIE_Msk                  /*!< Error Interrupt Enable */
#define USART_CR3_IREN_Pos                  (1U)
#define USART_CR3_IREN_Msk                  (0x1UL << USART_CR3_IREN_Pos)      /*!< 0x00000002 */
#define USART_CR3_IREN                      USART_CR3_IREN_Msk                 /*!< desc IREN */
#define USART_CR3_IRLP_Pos                  (2U)
#define USART_CR3_IRLP_Msk                  (0x1UL << USART_CR3_IRLP_Pos)      /*!< 0x00000004 */
#define USART_CR3_IRLP                      USART_CR3_IRLP_Msk                 /*!< desc IRLP */
#define USART_CR3_HDSEL_Pos                 (3U)
#define USART_CR3_HDSEL_Msk                 (0x1UL << USART_CR3_HDSEL_Pos)     /*!< 0x00000008 */
#define USART_CR3_HDSEL                     USART_CR3_HDSEL_Msk                /*!< Half-Duplex Selection */
#define USART_CR3_NACK_Pos                  (4U)
#define USART_CR3_NACK_Msk                  (0x1UL << USART_CR3_NACK_Pos)      /*!< 0x00000010 */
#define USART_CR3_NACK                      USART_CR3_NACK_Msk                 /*!< desc NACK */
#define USART_CR3_SCEN_Pos                  (5U)
#define USART_CR3_SCEN_Msk                  (0x1UL << USART_CR3_SCEN_Pos)      /*!< 0x00000020 */
#define USART_CR3_SCEN                      USART_CR3_SCEN_Msk                 /*!< desc SCEN */
#define USART_CR3_DMAR_Pos                  (6U)
#define USART_CR3_DMAR_Msk                  (0x1UL << USART_CR3_DMAR_Pos)      /*!< 0x00000040 */
#define USART_CR3_DMAR                      USART_CR3_DMAR_Msk                 /*!< DMA Enable Receiver */
#define USART_CR3_DMAT_Pos                  (7U)
#define USART_CR3_DMAT_Msk                  (0x1UL << USART_CR3_DMAT_Pos)      /*!< 0x00000080 */
#define USART_CR3_DMAT                      USART_CR3_DMAT_Msk                 /*!< DMA Enable Transmitter */
#define USART_CR3_RTSE_Pos                  (8U)
#define USART_CR3_RTSE_Msk                  (0x1UL << USART_CR3_RTSE_Pos)      /*!< 0x00000100 */
#define USART_CR3_RTSE                      USART_CR3_RTSE_Msk                 /*!< RTS Enable */
#define USART_CR3_CTSE_Pos                  (9U)
#define USART_CR3_CTSE_Msk                  (0x1UL << USART_CR3_CTSE_Pos)      /*!< 0x00000200 */
#define USART_CR3_CTSE                      USART_CR3_CTSE_Msk                 /*!< CTS Enable */
#define USART_CR3_CTSIE_Pos                 (10U)
#define USART_CR3_CTSIE_Msk                 (0x1UL << USART_CR3_CTSIE_Pos)     /*!< 0x00000400 */
#define USART_CR3_CTSIE                     USART_CR3_CTSIE_Msk                /*!< CTS Interrupt Enable */
#define USART_CR3_OVER8_Pos                 (11U)
#define USART_CR3_OVER8_Msk                 (0x1UL <<USART_CR3_OVER8_Pos)      /*!< 0x00000800 */
#define USART_CR3_OVER8                     USART_CR3_OVER8_Msk                /*!< Oversampling mode */
#define USART_CR3_ABREN_Pos                 (12U)
#define USART_CR3_ABREN_Msk                 (0x1UL <<USART_CR3_ABREN_Pos)      /*!< 0x00001000 */
#define USART_CR3_ABREN                     USART_CR3_ABREN_Msk                /*!< Auto baudrate enable */
#define USART_CR3_ABRMODE_Pos               (13U)
#define USART_CR3_ABRMODE_Msk               (0x3UL <<USART_CR3_ABRMODE_Pos)    /*!< 0x00006000 */
#define USART_CR3_ABRMODE                   USART_CR3_ABRMODE_Msk              /*!< ABRMODE[14:13] bits (desc ABRMODE) */
#define USART_CR3_ABRMODE_0                 (0x1UL <<USART_CR3_ABRMODE_Pos)    /*!< 0x00002000 */
#define USART_CR3_ABRMODE_1                 (0x2UL <<USART_CR3_ABRMODE_Pos)    /*!< 0x00004000 */

/*!< USART_GTPR */
#define USART_GTPR_PSC_Pos                  (0U)
#define USART_GTPR_PSC_Msk                  (0xFFUL << USART_GTPR_PSC_Pos)     /*!< 0x000000FF */
#define USART_GTPR_PSC                      USART_GTPR_PSC_Msk                 /*!< PSC[7:0] bits (desc PSC) */
#define USART_GTPR_GT_Pos                   (8U)
#define USART_GTPR_GT_Msk                   (0xFFUL << USART_GTPR_GT_Pos)      /*!< 0x0000FF00 */
#define USART_GTPR_GT                       USART_GTPR_GT_Msk                  /*!< GT[15:8] bits (desc GT) */

/*********************  Bits Define For Peripheral USBD  *********************/
/*!< USBD_CR */
#define USBD_CR_ADD_Pos                         (0U)
#define USBD_CR_ADD_Msk                         (0x7FUL << USBD_CR_ADD_Pos)                       /*!< 0x0000007F */
#define USBD_CR_ADD                             USBD_CR_ADD_Msk                                   /*!< desc ADD */
#define USBD_CR_ADD_0                           (0x1UL << USBD_CR_ADD_Pos)                        /*!< 0x00000001 */
#define USBD_CR_ADD_1                           (0x2UL << USBD_CR_ADD_Pos)                        /*!< 0x00000002 */
#define USBD_CR_ADD_2                           (0x4UL << USBD_CR_ADD_Pos)                        /*!< 0x00000004 */
#define USBD_CR_ADD_3                           (0x8UL << USBD_CR_ADD_Pos)                        /*!< 0x00000008 */
#define USBD_CR_ADD_4                           (0x10UL << USBD_CR_ADD_Pos)                       /*!< 0x00000010 */
#define USBD_CR_ADD_5                           (0x20UL << USBD_CR_ADD_Pos)                       /*!< 0x00000020 */
#define USBD_CR_ADD_6                           (0x40UL << USBD_CR_ADD_Pos)                       /*!< 0x00000040 */
#define USBD_CR_UPDATE_Pos                      (7U)
#define USBD_CR_UPDATE_Msk                      (0x1UL << USBD_CR_UPDATE_Pos)                     /*!< 0x00000080 */
#define USBD_CR_UPDATE                          USBD_CR_UPDATE_Msk                                /*!< desc UPDATE */
#define USBD_CR_Enable_Suspend_Pos              (8U)
#define USBD_CR_Enable_Suspend_Msk              (0x1UL << USBD_CR_Enable_Suspend_Pos)             /*!< 0x00000100 */
#define USBD_CR_Enable_Suspend                  USBD_CR_Enable_Suspend_Msk                        /*!< desc Enable_Suspend */
#define USBD_CR_Suspend_Mode_Pos                (9U)
#define USBD_CR_Suspend_Mode_Msk                (0x1UL << USBD_CR_Suspend_Mode_Pos)               /*!< 0x00000200 */
#define USBD_CR_Suspend_Mode                    USBD_CR_Suspend_Mode_Msk                          /*!< desc Suspend_Mode */
#define USBD_CR_Resume_Pos                      (10U)
#define USBD_CR_Resume_Msk                      (0x1UL << USBD_CR_Resume_Pos)                     /*!< 0x00000400 */
#define USBD_CR_Resume                          USBD_CR_Resume_Msk                                /*!< desc Resume */
#define USBD_CR_Reset_Pos                       (11U)
#define USBD_CR_Reset_Msk                       (0x1UL << USBD_CR_Reset_Pos)                      /*!< 0x00000800 */
#define USBD_CR_Reset                           USBD_CR_Reset_Msk                                 /*!< desc Reset */
#define USBD_CR_ISO_Update_Pos                  (15U)
#define USBD_CR_ISO_Update_Msk                  (0x1UL << USBD_CR_ISO_Update_Pos)                 /*!< 0x00008000 */
#define USBD_CR_ISO_Update                      USBD_CR_ISO_Update_Msk                            /*!< desc ISO_Update */

/*!< USBD_INTR */
#define USBD_INTR_Suspend_Pos                   (0U)
#define USBD_INTR_Suspend_Msk                   (0x1UL << USBD_INTR_Suspend_Pos)                  /*!< 0x00000001 */
#define USBD_INTR_Suspend                       USBD_INTR_Suspend_Msk                             /*!< desc Suspend */
#define USBD_INTR_Resume_Pos                    (1U)
#define USBD_INTR_Resume_Msk                    (0x1UL << USBD_INTR_Resume_Pos)                   /*!< 0x00000002 */
#define USBD_INTR_Resume                        USBD_INTR_Resume_Msk                              /*!< desc Resume */
#define USBD_INTR_Reset_Pos                     (2U)
#define USBD_INTR_Reset_Msk                     (0x1UL << USBD_INTR_Reset_Pos)                    /*!< 0x00000004 */
#define USBD_INTR_Reset                         USBD_INTR_Reset_Msk                               /*!< desc Reset */
#define USBD_INTR_SOF_Pos                       (3U)
#define USBD_INTR_SOF_Msk                       (0x1UL << USBD_INTR_SOF_Pos)                      /*!< 0x00000008 */
#define USBD_INTR_SOF                           USBD_INTR_SOF_Msk                                 /*!< desc SOF */
#define USBD_INTR_EP1OUT_Pos                    (9U)
#define USBD_INTR_EP1OUT_Msk                    (0x1UL << USBD_INTR_EP1OUT_Pos)                   /*!< 0x00000200 */
#define USBD_INTR_EP1OUT                        USBD_INTR_EP1OUT_Msk                              /*!< desc EP1OUT */
#define USBD_INTR_EP2OUT_Pos                    (10U)
#define USBD_INTR_EP2OUT_Msk                    (0x1UL << USBD_INTR_EP2OUT_Pos)                   /*!< 0x00000400 */
#define USBD_INTR_EP2OUT                        USBD_INTR_EP2OUT_Msk                              /*!< desc EP2OUT */
#define USBD_INTR_EP3OUT_Pos                    (11U)
#define USBD_INTR_EP3OUT_Msk                    (0x1UL << USBD_INTR_EP3OUT_Pos)                   /*!< 0x00000800 */
#define USBD_INTR_EP3OUT                        USBD_INTR_EP3OUT_Msk                              /*!< desc EP3OUT */
#define USBD_INTR_EP4OUT_Pos                    (12U)
#define USBD_INTR_EP4OUT_Msk                    (0x1UL << USBD_INTR_EP4OUT_Pos)                   /*!< 0x00001000 */
#define USBD_INTR_EP4OUT                        USBD_INTR_EP4OUT_Msk                              /*!< desc EP4OUT */
#define USBD_INTR_EP5OUT_Pos                    (13U)
#define USBD_INTR_EP5OUT_Msk                    (0x1UL << USBD_INTR_EP5OUT_Pos)                   /*!< 0x00002000 */
#define USBD_INTR_EP5OUT                        USBD_INTR_EP5OUT_Msk                              /*!< desc EP5OUT */
#define USBD_INTR_EP0_Pos                       (16U)
#define USBD_INTR_EP0_Msk                       (0x1UL << USBD_INTR_EP0_Pos)                      /*!< 0x00010000 */
#define USBD_INTR_EP0                           USBD_INTR_EP0_Msk                                 /*!< desc EP0 */
#define USBD_INTR_EP1IN_Pos                     (17U)
#define USBD_INTR_EP1IN_Msk                     (0x1UL << USBD_INTR_EP1IN_Pos)                    /*!< 0x00020000 */
#define USBD_INTR_EP1IN                         USBD_INTR_EP1IN_Msk                               /*!< desc EP1IN */
#define USBD_INTR_EP2IN_Pos                     (18U)
#define USBD_INTR_EP2IN_Msk                     (0x1UL << USBD_INTR_EP2IN_Pos)                    /*!< 0x00040000 */
#define USBD_INTR_EP2IN                         USBD_INTR_EP2IN_Msk                               /*!< desc EP2IN */
#define USBD_INTR_EP3IN_Pos                     (19U)
#define USBD_INTR_EP3IN_Msk                     (0x1UL << USBD_INTR_EP3IN_Pos)                    /*!< 0x00080000 */
#define USBD_INTR_EP3IN                         USBD_INTR_EP3IN_Msk                               /*!< desc EP3IN */
#define USBD_INTR_EP4IN_Pos                     (20U)
#define USBD_INTR_EP4IN_Msk                     (0x1UL << USBD_INTR_EP4IN_Pos)                    /*!< 0x00100000 */
#define USBD_INTR_EP4IN                         USBD_INTR_EP4IN_Msk                               /*!< desc EP4IN */
#define USBD_INTR_EP5IN_Pos                     (21U)
#define USBD_INTR_EP5IN_Msk                     (0x1UL << USBD_INTR_EP5IN_Pos)                    /*!< 0x00200000 */
#define USBD_INTR_EP5IN                         USBD_INTR_EP5IN_Msk                               /*!< desc EP5IN */

